/*Цик-цак е број за кој важи дека за секој пар соседни цифри во бројот важи дека едната е помала од 5, а другата е поголема или еднаква на 5. На пример, ако бројот x е составен од цифрите a, b, c и d, тогаш за нив важи:

a<5, b>=5, c<5, d>=5 или a>=5, b<5, c>=5, d<5

Пр.  508294, 2638, 81
Од тастатура се читаат непознат број на цели броеви поголеми од или еднакви на 10 (броевите помали од 10 се игнорираат). Читањето завршува во моментот кога ќе се прочита знак што не е цифра. Да се испечатат сите цик-цак броеви. */

#include <stdio.h>

int main() {
    int x, br = 0, tmp, cifra1, cifra2, p, f;

    while(scanf("%d", &x))
    {
        f=1;
        if(x>=10){
            tmp = x;
            cifra1 = tmp%10;
            tmp/=10;
            cifra2 = tmp%10;
            tmp/=10;
            if(cifra1<5&&cifra2>=5)
            {
                p=1;
            }
            else if(cifra1>=5&&cifra2<5)
            {
                p=0;
            }
            else
                f = 0;
            cifra1 = cifra2;
            if(f)
            {
                while(tmp) {
                    cifra2 = tmp%10;
                    if(p){
                        if(!(cifra1>=5 && cifra2<5)){
                            f=0;
                            break;
                        }
                        else
                            p = 0;
                    }
                    else{
                    	if(!(cifra1<5 && cifra2>=5)){
                            f=0;
                            break;
                        }
                        else
                            p = 1;
                    }
                    tmp /= 10;
                    cifra1 = cifra2;
                }
            }
            if(f)
                printf("%d\n", x);
        }

    }

    return 0;
}
