/*Од тастатура се внесува број на студенти кои ќе полагаат колоквиум, а потоа и индексите (цели броеви) на сите студенти кои ќе полагаат колоквиум. Програмата треба да ги подели студентите во три групи: студенти со индекси кои завршуваат на цифрата 0, 1 и 2, студенти со индекси кои завршуваат на цифрата 3, 4, 5 и студенти со индекси кои завршуваат на цифрата 6, 7, 8, 9. Програмата треба да ги испечати индексите за секоја група, во истиот редослед како што биле внесени. Максималниот број на студенти што може да се внесат е 1000.

Напомена: Оваа задача е за материјалот наменет за втор колоквиум и истата се решава со користење на низи.

Влез:

10 //Kolku studenti?

20010 20145 20147 20139 20581 19452 19873 19825 19458 20653 //Koi studenti?


Излез

Grupa 1

20010 20581 19452 


Grupa 2

20145 19873 19825 20653


Grupa 3

20147 20139 19458
 */ #include <stdio.h>

 int main()
 {
     int n;
     scanf("%d",&n);
     int niza1[1000], niza2[1000], niza3[1000];
     int i,j=0,k=0,z=0;
     for(i=0;i<n;i++)
     {
        int broj;
        scanf("%d",&broj);
        if(broj%10==0||broj%10 ==1|| broj%10==2)
        {
            niza1[j++] = broj;
        }
        else if(broj%10==3||broj%10 ==4 || broj%10==5)
        {
            niza2[k++] = broj;
        }
        else{
            niza3[z++] = broj;
        }
     }
     printf("Grupa 1\n");
     for(i=0;i<j;i++)
     {
         printf("%d ",niza1[i]);
     }

     printf("\nGrupa 2\n");
     for(i=0;i<k;i++)
     {
         printf("%d ",niza2[i]);
     }

     printf("\nGrupa 3\n");
     for(i=0;i<z;i++)
     {
         printf("%d ",niza3[i]);
     }

 }
