/*Од тастатура се внесува колку студенти полагале колоквиум и потоа се внесуваат поените на сите кои полагале. Програмата треба да отпечати средна вредност на поените на сите студенти кои имале помалку од 50 поени, како и список на студентите со повеќе од 50 поени. Исто така програмата да отпечати средна вредност на поените на сите кои положиле со најмалку 50 поени и нивните освоени поени (редоследот на печатење во двата случаеви треба да биде ист како и редоследот на внесување). Максималниот број на студенти што може да се внесат е 1000.

Напомена: Оваа задача е за материјалот наменет за втор колоквиум и истата се решава со користење на низи.

Влез:

10 //Kolku studenti?

20 10 50 60 70 90 40 20 70 90 //Poeni?

Излез

Sredna vrednost na padnati 22.50

20 10 40 20 

Sredna vrednost na polozeni 71.67

50 60 70 90 70 90*/
 #include <stdio.h>

 int main()
 {
     int n;
     scanf("%d",&n);
     int niza1[1000], niza2[1000], niza3[1000];
     int i,j=0,k=0,z=0;
     float avg1=0,avg2=0;
     for(i=0;i<n;i++)
     {
        int broj;
        scanf("%d",&broj);
        if(broj>=50)
        {
            avg1+=broj;
            niza1[j++] = broj;
        }
        else
        {
            avg2+=broj;
            niza2[k++] = broj;
        }
     }
     avg1 = avg1/j;
     avg2 = avg2/k;
     printf("Sredna vrednost na padnati %.2f\n",avg2);
     for(i=0;i<k;i++)
     {
         printf("%d ",niza2[i]);
     }

     printf("\nSredna vrednost na polozeni %.2f\n",avg1);
     for(i=0;i<j;i++)
     {
         printf("%d ",niza1[i]);
     }


 }
