/*Од стандарден влез се чита еден природен број n. Меѓу природните броеви помали од n, да се најде оној чиј што збир на делителите е најголем. Во пресметувањето на збирот на делителите на даден број, да не се зема предвид самиот број. */
#include <stdio.h>
int main (){
    int n,max=0;
    int b = 0;
    scanf("%d",&n);
    n--;
    
    while(n>0)
    {
        int zbir = 0;
        for(int i=1;i<n;i++){
            if(n%i==0)
            {
                zbir=zbir+i;
            }
        }
        if(zbir>b)
        {
         b=zbir;
         max=n;
        }
        n--;
    }
    printf("%d",max);
    return 0;
}