/*Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.

Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.

Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.

Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1) */
#include <stdio.h>
int main (){
    int a,b;
    scanf("%d %d",&a,&b);
    if(a>0 && b>0)
    {
        int golem,mal;
        if(a>b)
        {
            golem=a;
            mal=b;
        }
        else{
            golem=b;
            mal=a;
        }
        while(golem!=0)
        {
            golem/=10;
            if(golem%10 != mal%10)
            {
               printf("NE");
               return 0;
            }
            golem/=10;
            mal/=10;
        }
        printf("PAREN");
    }
    else{
         printf("Invalid input"); 
    }
    return 0;
}