/* Пресметајте ја цената за електрична енергија која еден корисник треба да ја плати, во зависност од тоа колку kWh потрошил. За помалку 500 kWh се наплаќа 5 ден/kWh. Ако трошокот ја надмине оваа граница, тогаш за наредните 150 kWh се наплаќа 7.5 ден/kWh, за наредните 200 kWh се наплаќа 11 ден/kWh, а за секој трошок над тоа се доплаќа уште 13.5 ден/kWh. На крајот на сметката се додава 10% ДДВ доколку изнесува 7000 денари или помалку, додека ако изнесува повеќе од тоа, се додава 18% ДДВ. */

#include <stdio.h>
int main (){
    int n;
    float cena,cena2,cena3,cena4;
    scanf("%d",&n);
    if(n>=0 && n<=500 )
    {
        cena = n*5;
    }
    if(n>500 && n<=650)
    {
        cena  = 500*5;
        cena2 = (n-500)*7,5;
        cena  = cena+cena2;
    }
    if(n>650 && n<=850)
    {
        cena  = 2500;
        cena2 = 1125;
        cena3 = (n-650)*11;
        cena  = cena+cena2+cena3;
    }
    if(n>850)
    {
        cena  = 2500;
        cena2 = 1125;
        cena3 = 2200;
        cena4 = (n-850)*13.5;
        cena  = cena+cena2+cena3+cena4;
    }
    if(cena>7000)
    {
        cena = cena + cena*0.18;
    }
    else
    {
        cena = cena + cena*0.10;
    }
    printf("%.2f",cena);
    
    return 0;
}
    return 0;
}