/*Од стандарден влез да се прочита квадратна матриција со број на редици и колони N. Прво се вчитува бројот N а потоа и N*N елементите на матрицата.

Да се промени знакот на елементите од главната дијагонала на матрицата (позитивните да станат негативни и обратно). 

Да се испечати трансформираната матрица на екран (Секој елемент од матрицата се печати со 3 места - %3d). */

#include <stdio.h>
int main()
{
    int n;
    scanf("%d",&n);
    int niza[n][n];
    for(int i=0; i<n; i++)
    {
        for(int j=0; j<n; j++)
        {
            scanf("%d",&niza[i][j]);
        }
    }
    for(int i=0; i<n; i++)
    {
        for(int j=0; j<n; j++)
        {
            if(i==j)
            {
                niza[i][j]=niza[i][j]*-1;
            }
            printf("%3d ",niza[i][j]);
        }
        printf("\n");
    }
    return 0;
}
}