/*Од стандарден влез се вчитува матрица сo m редици и n колони. Прво се вчитуваат броевите m и n а потоа и елементите на матрицата.

Да се изврши min-max нормализација на секоја колона од матрицата, односно секој елемент во секоја колона да се замени со вредноста x−minmax−min
 каде што x е елемент во некоја колона, а max и min се соодветно најголемиот и најмалиот елемент во соодветната колона.

Трансформираната матрица да се испечати на екран.

Објаснување на примерот:

Елементите на 0-тата колона се: 1,6,11,16,21. Минимален елемент е 1, а максимален елемент е 21

Секој од 5те елементи ќе се трансформира на следниот начин:

(1-1)/(21-1) = 0/20 = 0.00
(6-1)/(21-1) = 5/20 = 0.25
(11-1)/(21-1) = 10/20 = 0.50
(16-1)/(21-1) = 15/20 = 0.75
(21-1)/(21-1) = 20/20 = 1.00*/
#include <stdio.h>

int main()
{
  int m,n;
  scanf("%d %d",&m,&n);
  double min,max;
  double niza[m][n];
  for(int i=0; i<m; i++)
  {
    for(int j=0; j<n; j++)
    {
        scanf("%lf",&niza[i][j]);
    }
  }
  for(int j=0; j<n; j++)
  {
    min=max=niza[0][j];
    for(int i=0; i<m; i++)
    {
        if(niza[i][j]>max)
        max=niza[i][j];
        if(niza[i][j]<min)
        min=niza[i][j];
    }
    for(int i=0; i<m; i++)
    {
        niza[i][j]=(niza[i][j]-min)/(max-min);
    }
  }
  for(int i=0; i<m; i++)
  {
      for(int j=0; j<n; j++)
      {
        printf("%0.2lf ",niza[i][j]);
      }
      printf("\n");
  }
  return 0;
}