/*Од стандарден влез се вчитува квадратна матрица со n редици и колони. Прво се вчитува бројот n, па потоа и n елементите на матрицата.

Доколку n е непарен број да се испечати пораката GRESKA и да заврши програмата.

Потребно е матрицата да се здипли како што е прикажано на сликата. При диплење на матрицата, се собираат елементите на позициите што се поклопуваат при диплењето */
#include <stdio.h>

int main()
{
    int n;
    scanf("%d", &n);
    int niza[n][n];
    if(n%2==0)
    {
        for(int i=0; i<n; i++)
        {
            for(int j=0; j<n; j++)
            {
                scanf("%d", &niza[i][j]);
            }
        }
        for(int i=0; i<n/2; i++)
        {
            for(int j=0;j<n/2;j++)
            {
                niza[i][j]=niza[i][j]+
                niza[i][n-1-j]+
                niza[n-1-i][j]+
                niza[n-1-i][n-1-j];
                printf("%d ",niza[i][j]);
            }
            printf("\n");
        }
    }
    else
    {
        printf("GRESKA");
    }
    return 0;
}
