/* Се внесува време во македонска форма (3 вредности: час - од 0 до 23, минути – од 0 до 59, и секунди – од 0 до 59). Да се презентира времето во интернационална форма во која за 0 часот стои 12, од 13 часот до 23 се всушност од 1 до 11, а на крајот стои AM доколку времето е претпладне (од 0:00:00 до 11:59:59) и PM доколку времето е попладне (од 12:00:01 до 23:59:59). За времето на пладне (12:00:00) после него се печати NOON. */

#include <stdio.h>
int main ()
{
    int cas,min,sek;
    int casNOV;
    scanf("%d %d %d",&cas, &min, &sek);
    if(cas >= 13 && cas <= 23)
    {
        casNOV=cas-12;
    }
    if(cas>= 1 && cas <= 12)
    {
        casNOV=cas;
    }
    if(cas == 0)
    {
        casNOV=12;
    }
    
        if(cas == 12 && min == 0 && sek == 0)
        {
            printf("%.02d:%.02d:%.02dNOON\n",casNOV,min,sek);
        }
        
        if( (cas >= 0 && min >=0 && sek >= 0) && (cas <=11 && min <= 59 && sek <=59) )
        {
            printf("%.02d:%.02d:%.02dAM\n",casNOV,min,sek);
        }
        
        if( (cas >= 12 && min >=0 && sek >= 1) && (cas <=23 && min <= 59 && sek <=59) )
        {
            printf("%.02d:%.02d:%.02dPM\n",casNOV,min,sek);
        }
    
    return 0;
}