/* Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.

Внесената низа да се трансформира на начин што парните елементи ќе се зголемат за 1, а непарните ќе се намалат за 1.

Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив. */

#include <stdio.h> 
int main()
{
    int n;
    scanf("%d", &n);
    int NIZA[n];
    for(int i=0; i<n; i++)
    {
        scanf("%d", &NIZA[i]);
        if(NIZA[i]%2!=0)
        {
            NIZA[i]--;
        }
        else
        {
            NIZA[i]++;
        }
    }
    for(int i=0; i<n; i++)
    {
        printf("%d ", NIZA[i]);
    }
    return 0;
}
            printf("%.02d:%.02d:%.02dPM\n",casNOV,min,sek);
        }
    
    return 0;
}