/*Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение. Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.

На пример, ако е дадена следната матрица:

1 2 3 9 8
5 5 5 5 5 
0 1 2 0 0 
9 1 2 3 4 
1 1 1 1 1
должината на најдолгата строго растечка подниза е 4, а тоа е должината на поднизата 1 2 3 4, во четвртиот ред. */

#include <stdio.h>
int main()
{
    int n;
    scanf("%d",&n);
    int niza[n][n];
    int count=0,pred=0,maxCount=0;
    int b=1;
    for(int i=0; i<n; i++)
    {
        count = 0;
        for(int j=0; j<n; j++)
        {
            scanf("%d",&niza[i][j]);
            if(pred<niza[i][j])
            {
                count++;
            }
            while(b!=0)
            {
                pred=niza[i][j];
                b--;
            }
            if(count>maxCount)
            {
                maxCount=count;
            }
            pred=niza[i][j];
        }
    }
    printf("%d",maxCount);

    return 0;
}