/*Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.

Пример.

Влез:

31
4  2  7  11
3  8  16 1
17 8  9  5
6  14 4  7
5  15 5  6
Излез:

-1 -1 -1 -1
-1 -1 -1 -1
 1  1  1  1 	
 0  0  0  0 
 0  0  0  0

*/
#include<stdio.h>

int main()
{
    int x,m,n;
    scanf("%d",&x);
    scanf("%d%d",&m,&n);
    int a[m][n],i,j;
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    int zbir=0;
    for(i=0;i<m;i++)
    {
        zbir=0;
        for(j=0;j<n;j++)
        {
            zbir+=a[i][j];
            if(j==n-1)
            {
                if(zbir>x)
                {
                    for(j=0;j<n;j++)
                    {
                        a[i][j]=1;
                    }
                }
                if(zbir<x)
                {
                    for(j=0;j<n;j++)
                    {
                        a[i][j]=-1;
                    }
                }
                if(zbir==x)
                {
                    for(j=0;j<n;j++)
                    {
                        a[i][j]=0;
                    }
                }
            }
        }
    }
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            printf("%d ",a[i][j]);
        }
        printf("\n");
    }
    
    return 0;
}