/*Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.

Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број. За секој од нив да се испечати максималната цифра во посебен ред.

Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.

Забелешка: ЗАБРАНЕТО е користење на глобални променливи.
*/
#include <stdio.h>

int max(int nInput,int MaxNum)
{
      if(nInput==0)
      {
        return MaxNum;
      }
      if(nInput/10%10 > MaxNum%10)
      {
        MaxNum = nInput/10%10;
      }
      return max(nInput/10,MaxNum%10);
}

int main()
{
    int n;
    while(scanf("%d",&n))
    {
        printf("%d\n",max(n,n));
    }
}