/*За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви). Нека X e збирот од елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова матрица B на следниот начин:

сите елементи од главната дијагонала во матрицата B треба да имаат вредност X

сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y

ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y

сите останати елементи во матрицата B имаат вредност 0

Новата матрица B да се испечати на стандарден излез.

ПРИМЕР:

Матрица A

5    5.5   6     1.2   2.5
8    95.1  21.3  13    0.2
34   4.1   37.4  22    6
4.1  5.5   0.7   7     0
41   1.1   3.2   7.5   1.8
Матрица B
110.2   0     0     0    49.5
  0   110.2   0   49.5     0
  0     0   159.7   0      0
  0   49.5    0   110.2    0
 49.5   0     0     0    110.2

*/
#include <stdio.h>
int main()
{
    float zbirX=0,zbirY=0;
    int n;
    scanf("%d",&n);
    double A[n][n];
    double B[n][n];
    
    for(int i=0; i<n; i++)
    {
        for(int j=0; j<n; j++)
        {
            scanf("%lf ",&A[i][j]);
            if(i>j)
            {
                zbirX=zbirX+A[i][j];
            }
            if(n-i-1<j)
            {
                zbirY=zbirY+A[i][j];
            }
        }
    }
    
    //Print Matrix
    if(n % 2 == 0)
    {
        for(int i=0; i<n; i++)
        {
            for(int j=0; j<n; j++)
            {
                if(i==j)
                {
                    B[i][j]=zbirX;
                    printf("%.1lf ",B[i][j]);
                }
                else if(i+j==n-1)
                {
                    B[i][j]=zbirY;
                    printf("%.1lf ",B[i][j]);
                }
                else
                {
                    B[i][j]=0;
                    printf("%.1lf ",B[i][j]);
                }
            }
            printf("\n");
        }
    }

    else 
    {
        for(int i=0; i<n; i++)
        {
            for(int j=0; j<n; j++)
            {
                if(i == n/2 && j == n/2)
                {
                    B[i][j]= zbirX + zbirY;
                    printf("%.1lf ",B[i][j]);
                }
                else if(i==j)
                {
                    B[i][j]=zbirX;
                    printf("%.1lf ",B[i][j]);
                }
                else if(i+j==n-1)
                {
                    B[i][j]=zbirY;
                    printf("%.1lf ",B[i][j]);
                }
                else
                {
                    B[i][j]=0;
                    printf("%.1lf ",B[i][j]);
                }
            }
            printf("\n");
        }
    }
    return 0;
}