/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
*
#include <stdio.h>
int main()
{
    int m,n;
    scanf("%d %d ", &m, &n);
    int niza[m][n];
    int i,j,a,b;
    int prv=0,vtor=0,tret=0,cet=0;
    for(i = 0; i < m; i++)
    {
        for(j = 0; j < n; j++)
        {
            scanf("%d", &niza[i][j]);
        }
    }
    scanf("%d %d", &a,&b);
    
    
    
    //prvi
    for(i = 0; i < a; i++)
    {
        for(j = b; j < n; j++)
        {
            prv = niza[i][j] + prv;
        }
    }
    //vtori
    for(i = 0; i < b; i++)
    {
        for(j = 0; j < a; j++)
        {
            vtor = niza[i][j] + vtor;
        }
    }
    //treti
    for(i = a; i < m; i++)
    {
        for(j = 0; j < b; j++)
        {
            tret = niza[i][j] + tret;
        }
    }
    //cetvrti
    for(i = a; i < m; i++)
    {
        for(j = b; j < n; j++)
        {
            cet = niza[i][j] + cet;
        }
    }
    printf("%d %d %d %d ", prv,vtor,tret,cet);
    
    return 0;
}